AI/logicalreg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Basic Logical Regression</title>
<!-- 2016-01-24 Sun 07:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Basic Logical Regression</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Hypothesis Function</a></li>
<li><a href="#sec-3">Cost Function</a></li>
<li><a href="#sec-4">Gradient Descent Equation</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Machine learning problems that are classified as classification
problems are taking input variables and mapping the output to a
discrete value. These notes provide the basic solution for a logical
regression algorithm for a binary classification problem.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Hypothesis Function</h2>
<div class="outline-text-2" id="text-2">
<p>
The hypothesis function is an equation that we use to estimate the
output function. We use a series of steps later to resolve this
function to within acceptable limits.
</p>

<p>
$$0 \leq h_\theta(x) \leq 1$$
</p>

<p>
$$h_\theta(x) = g(\theta^Tx)$$
</p>

<p>
$$z = \theta^Tx$$
</p>

<p>
$$g(z) = \frac{1}{1+e^{-z}}$$
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Cost Function</h2>
<div class="outline-text-2" id="text-3">
<p>
We can make initial guesses for the parameters of the hypothesis
function and use a cost function to measure the accuracy:
</p>

<p>
$$J(\theta) = - \frac{1}{m}(\log(g(X\theta))^Ty +
log(1-g(X\theta))^T(1-y))$$
</p>

<p>
Now that we have both an estimate in the form of an hypothesis
function and a means to measure it's accuracy using the cost function,
we need a way to automatically improve our hypothesis function.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Gradient Descent Equation</h2>
<div class="outline-text-2" id="text-4">
<p>
For this we use a gradient descent equation which, for the case of
the linear regression simplifies to the following vectorised
equation.
</p>

<p>
$$\theta := \theta - \frac{\alpha}{m}X^T(g(X\theta) - \vec{y}
)$$
</p>

<p>
alpha is the learning rate of the gradient descent equation, and m
is the size of the training set.
</p>

<p>
We can now repeat the gradient descent equation until the solution
converges within an acceptable limit.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-01-24 Sun 07:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
